# 面向对象编程：oop Object Oriented Programming 是一支国内python的编程思路
#
# 面向过程：
# 就是我们一开始学习的，按照解决问题的步骤去写代码
# 【根据业务逻辑去写代码】
# 在思考问题的时候，首先分析‘怎么按照步骤取实现’
# 然后将问题解决拆解成若干个步骤，并将这些步骤对应成方法一步一步的最终完成功能
#
# 面向对象：
# 关注的是设计思维【如：找洗车店，给钱洗车】

# 从计算机的角度来看，面向过程不适合做大项目，功能、逻辑不好去扩展
# 而面向对象适合做更大的项目

# 面向过程关注的是：怎么做
# 面向对象关注的是：谁来做


# *** * 类和对象的概念 * ***
# 类和对象是面向对象编程中重要的概念
# 类：是一个模板，模板里面可以包含多个函数，函数里面实现一些功能
# 对象：是根据模板创建的实例，通过实例对象可以执行类中的函数

# 类的组成部分
# 类（Class）由3个部分构成
#     类的名称：类名——人
#     类的属性：一组数据——身高、体重、爱好名字
#     类的方法：允许进行操作的方法（行为）——跑、跳、说话

# 类的概括：类是具有一组相同 或者相似特征【属性】和 行为【方法】 的一系列【多个】对象集合

# 对象：对象是实实在在的一个东西，相当于类的实例化、具象化

# 实例方法：在类的内部 使用def关键字来定义，第一个参数默认是：self
# 【名字标识可以是其他名字，但是这个位置必须被占用】

# 实例方法是归于类的实例所有









